Revit 2026 API

# RailingIsValidHostForNewRailing Method

---

Checks whether new railing can be created and placed on the specified host.

**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static bool IsValidHostForNewRailing(
	Document document,
	ElementId elementId
)
```
```vb
Public Shared Function IsValidHostForNewRailing (
	document As Document,
	elementId As ElementId
) As Boolean
```
```cpp
public:
static bool IsValidHostForNewRailing(
	Document^ document,
	ElementId^ elementId
)
```
```fsharp
static member IsValidHostForNewRailing :
        document : Document *
        elementId : ElementId -> bool
```

#### Parameters

document Document
     The document.
elementId ElementId
     The element to check.

#### Return Value

Boolean True if new railing can be created and placed on the host, False otherwise.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

This function will return true for stairs or ramps which can host new railings. Stairs or ramps can host new railings only when they have no associated railing and they are not in editing mode.

#### Reference

Railing Class

Autodesk.Revit.DB.Architecture Namespace